# Pandas
-----
## 06. 데이터 합치기와 변형
### 데이터프레임 합치기 (Dataframe Merging)
- Concatenation (연결) : concat
- Merge (병합) : merge
- Join (조인) : join

### concat

In [12]:
# 제공된 코드
from IPython.display import display
import pandas as pd

data1 = {'ID': [1, 2, 3, 4],
         'Name': ['Alice', 'Bob', 'Charlie', 'David'],
         'Age': [25, 30, 22, 28]}
df1 = pd.DataFrame(data1)

data2 = {'ID': [3, 4, 5, 6],
         'Salary': [50000, 60000, 70000, 80000]}
df2 = pd.DataFrame(data2)

display("df1", df1)
display("df2", df2)
# /제공된 코드

display("행방향 연결", pd.concat([df1, df2]))
display("열방향 연결", pd.concat([df1, df2], axis=1))

'df1'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

'df2'

   ID  Salary
0   3   50000
1   4   60000
2   5   70000
3   6   80000

'행방향 연결'

   ID     Name   Age   Salary
0   1    Alice  25.0      NaN
1   2      Bob  30.0      NaN
2   3  Charlie  22.0      NaN
3   4    David  28.0      NaN
0   3      NaN   NaN  50000.0
1   4      NaN   NaN  60000.0
2   5      NaN   NaN  70000.0
3   6      NaN   NaN  80000.0

'열방향 연결'

   ID     Name  Age  ID  Salary
0   1    Alice   25   3   50000
1   2      Bob   30   4   60000
2   3  Charlie   22   5   70000
3   4    David   28   6   80000

### merge
- 두 데이터프레임 사이에 공통된 컬럼이나 인덱스를 기준으로 데이터를 합치는 작업을 수행
    - on 매개변수로 기준 컬럼 지정
- SQL의 Join과 비슷한 개념

In [14]:
display("df1", df1)
display("df2", df2)

display(pd.merge(df1, df2, on='ID'))

'df1'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

'df2'

   ID  Salary
0   3   50000
1   4   60000
2   5   70000
3   6   80000

   ID     Name  Age  Salary
0   3  Charlie   22   50000
1   4    David   28   60000

### join
- 인덱스를 기준으로 두 개의 데이터프레임을 조인
- how:
    - left, right, inner, outer 조인 등 다양한 방법을 지원
    - 기본 방식은 left

In [20]:
display("df1", df1)
display("df2", df2)

display("left", df1.join(df2, lsuffix="_df1", rsuffix="_df2"))
display("left", df1.join(df2.set_index("ID"), on="ID", how="left"))

'df1'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

'df2'

   ID  Salary
0   3   50000
1   4   60000
2   5   70000
3   6   80000

'left'

   ID_df1     Name  Age  ID_df2  Salary
0       1    Alice   25       3   50000
1       2      Bob   30       4   60000
2       3  Charlie   22       5   70000
3       4    David   28       6   80000

'left'

   ID     Name  Age   Salary
0   1    Alice   25      NaN
1   2      Bob   30      NaN
2   3  Charlie   22  50000.0
3   4    David   28  60000.0

In [22]:
display("df1", df1)
display("df2", df2)

display("right", df1.join(df2.set_index("ID"), on="ID", how="right"))

'df1'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

'df2'

   ID  Salary
0   3   50000
1   4   60000
2   5   70000
3   6   80000

'right'

     ID     Name   Age  Salary
2.0   3  Charlie  22.0   50000
3.0   4    David  28.0   60000
NaN   5      NaN   NaN   70000
NaN   6      NaN   NaN   80000

In [23]:
display("df1", df1)
display("df2", df2)

display("inner", df1.join(df2.set_index("ID"), on="ID", how="inner"))

'df1'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

'df2'

   ID  Salary
0   3   50000
1   4   60000
2   5   70000
3   6   80000

'inner'

   ID     Name  Age  Salary
2   3  Charlie   22   50000
3   4    David   28   60000

In [24]:
display("df1", df1)
display("df2", df2)

display("outer", df1.join(df2.set_index("ID"), on="ID", how="outer"))

'df1'

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

'df2'

   ID  Salary
0   3   50000
1   4   60000
2   5   70000
3   6   80000

'outer'

     ID     Name   Age   Salary
0.0   1    Alice  25.0      NaN
1.0   2      Bob  30.0      NaN
2.0   3  Charlie  22.0  50000.0
3.0   4    David  28.0  60000.0
NaN   5      NaN   NaN  70000.0
NaN   6      NaN   NaN  80000.0

### 데이터 변형 및 조작
- 피벗 테이블
- Melt
- Stack과 Unstack

### Melt
- 넓은 형식의 데이터프레임을 긴 형식으로 변형하는 방법
- melt 함수의 구조
    - frame: 변형하고자 하는 데이터프레임
    - id_vars: 그대로 유지할 열의 이름(식별자 변수)을 지정
    - value_vars: 변형할 열의 이름을 지정
    - var_name: value_vars가 이동하는 열의 이름을 지정
    - value_name: value_vars가 이동하는 값의 열 이름을 지정

In [28]:
# 제공된 코드
from IPython.display import display
import pandas as pd

data = {'ID': [1, 2, 3],
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Eng': [85, 90, 87],
        'Math': [90, 85, 78],
        'Science': [88, 92, 80]}
df = pd.DataFrame(data)
display(df)
# /제공된 코드

# Eng, Math, Science 열을 긴 형식으로 변환 (melt)
melted_df = pd.melt(df, # 변형할 데이터프레임
                    id_vars=['ID', 'Name'], # 유지할 열의 이름
                    value_vars=['Eng', 'Math', 'Science'],  # 변형할 열의 이름
                    var_name='Subject', # value_vars가 이동할 열의 이름
                    value_name='Score') # value_vars가 이동하는 값의 열 이름
display(melted_df)

   ID     Name  Eng  Math  Science
0   1    Alice   85    90       88
1   2      Bob   90    85       92
2   3  Charlie   87    78       80

   ID     Name  Subject  Score
0   1    Alice      Eng     85
1   2      Bob      Eng     90
2   3  Charlie      Eng     87
3   1    Alice     Math     90
4   2      Bob     Math     85
5   3  Charlie     Math     78
6   1    Alice  Science     88
7   2      Bob  Science     92
8   3  Charlie  Science     80

#### Stack과 Unstack
- 판다스에서 다중 인덱스를 가지는 데이터프레임을 재구성하는데 사용하는 메서드들
- 데이터프레임의 인덱스와 컬럼을 재배치하여 다른 형태로 변환할 수 있다

##### Stack
- 데이터프레임의 컬럼들을 인덱스 레벨로 이동시기는 기능 수행
    - 열 데이터를 행 데이터로 변환하는 작업
    - 기본적으로 가장 안쪽(가장 낮은 레벨)의 컬럼들을 인덱스 레벨로 이동

In [37]:
from IPython.display import display
import pandas as pd

df = melted_df.copy()
del df['ID']
df.set_index(['Name', 'Subject'])
stacked_df = df.stack()
stacked_df

0  Name         Alice
   Subject        Eng
   Score           85
1  Name           Bob
   Subject        Eng
   Score           90
2  Name       Charlie
   Subject        Eng
   Score           87
3  Name         Alice
   Subject       Math
   Score           90
4  Name           Bob
   Subject       Math
   Score           85
5  Name       Charlie
   Subject       Math
   Score           78
6  Name         Alice
   Subject    Science
   Score           88
7  Name           Bob
   Subject    Science
   Score           92
8  Name       Charlie
   Subject    Science
   Score           80
dtype: object

##### unstack
- unstack : stack의 반대 작업 수행
    - 다중 인덱스를 가진 데이터프레임에서 특정 레벨의 인덱스를 컬럼으로 이동
    - 기본적으로 가장 낮은 레벨의 인덱스를 컬럼으로 이동

In [42]:
display(stacked_df)

unstacked_df = stacked_df.unstack()
display(unstacked_df)

0  Name         Alice
   Subject        Eng
   Score           85
1  Name           Bob
   Subject        Eng
   Score           90
2  Name       Charlie
   Subject        Eng
   Score           87
3  Name         Alice
   Subject       Math
   Score           90
4  Name           Bob
   Subject       Math
   Score           85
5  Name       Charlie
   Subject       Math
   Score           78
6  Name         Alice
   Subject    Science
   Score           88
7  Name           Bob
   Subject    Science
   Score           92
8  Name       Charlie
   Subject    Science
   Score           80
dtype: object

      Name  Subject Score
0    Alice      Eng    85
1      Bob      Eng    90
2  Charlie      Eng    87
3    Alice     Math    90
4      Bob     Math    85
5  Charlie     Math    78
6    Alice  Science    88
7      Bob  Science    92
8  Charlie  Science    80